'use strict';
angular.module('app')
        .controller('Chart', function($scope, $element, $stateParams, NgTableParams, SimpleList) {

            $scope.forms = {
                key: '',
                department: '',
                dateEntryFrom: '',
                dateEntryUntil: ''
            }

            $scope.dimensions = [{
                id: 0,
                name: '沟通方式'
            }, {
                id: 1,
                name: '职级'
            }, {
                id: 2,
                name: '近3年商业领袖职能'
            }, {
                id: 3,
                name: '近3年海外回机关',
                checked: true
            }, {
                id: 4,
                name: '沟通发起'
            }, {
                id: 5,
                name: '部门'
            }, {
                id: 6,
                name: '年龄段'
            }, {
                id: 7,
                name: '是否管理者'
            }, {
                id: 8,
                name: '人才类型'
            }, {
                id: 9,
                name: '工作地'
            }];
            //pie
            $scope.data_flot = [{
                label: 'success',
                data: 31
            }, {
                label: 'other',
                data: 140
            }];
            //lines
            var sin = [],
                cos = [];
            for (var i = 0; i < 14; i += 0.1) {
                sin.push([i, Math.sin(i)]);
                cos.push([i, Math.cos(i)]);
            };
            $scope.data_flot1 = [
                { data: sin, label: "sin(x) = -0.00" },
                { data: cos, label: "cos(x) = -0.00" }
            ];
            //bars
            $scope.data_flot2 = [
                [
                    ["一月", 10],
                    ["二月", 8],
                    ["三月", 4],
                    ["四月", 13],
                    ["五月", 17],
                    ["六月", 9],
                    ["七月", 9],
                    ["八月", 9],
                    ["九月", 9],
                    ["十月", 9],
                    ["十一月", 9],
                    ["十二月", 9]
                ]
            ];

            $scope.data_flot3 = [{
                label: "United States",
                data: [
                    [1990, 18.9],
                    [1991, 18.7],
                    [1992, 18.4],
                    [1993, 19.3],
                    [1994, 19.5],
                    [1995, 19.3],
                    [1996, 19.4],
                    [1997, 20.2],
                    [1998, 19.8],
                    [1999, 19.9],
                    [2000, 20.4],
                    [2001, 20.1],
                    [2002, 20.0],
                    [2003, 19.8],
                    [2004, 20.4]
                ]
            }, {
                label: "Russia",
                data: [
                    [1992, 13.4],
                    [1993, 12.2],
                    [1994, 10.6],
                    [1995, 10.2],
                    [1996, 10.1],
                    [1997, 9.7],
                    [1998, 9.5],
                    [1999, 9.7],
                    [2000, 9.9],
                    [2001, 9.9],
                    [2002, 9.9],
                    [2003, 10.3],
                    [2004, 10.5]
                ]
            }, {
                label: "United Kingdom",
                data: [
                    [1990, 10.0],
                    [1991, 11.3],
                    [1992, 9.9],
                    [1993, 9.6],
                    [1994, 9.5],
                    [1995, 9.5],
                    [1996, 9.9],
                    [1997, 9.3],
                    [1998, 9.2],
                    [1999, 9.2],
                    [2000, 9.5],
                    [2001, 9.6],
                    [2002, 9.3],
                    [2003, 9.4],
                    [2004, 9.79]
                ]
            }, {
                label: "Germany",
                data: [
                    [1990, 12.4],
                    [1991, 11.2],
                    [1992, 10.8],
                    [1993, 10.5],
                    [1994, 10.4],
                    [1995, 10.2],
                    [1996, 10.5],
                    [1997, 10.2],
                    [1998, 10.1],
                    [1999, 9.6],
                    [2000, 9.7],
                    [2001, 10.0],
                    [2002, 9.7],
                    [2003, 9.8],
                    [2004, 9.79]
                ]
            }, {
                label: "Denmark",
                data: [
                    [1990, 9.7],
                    [1991, 12.1],
                    [1992, 10.3],
                    [1993, 11.3],
                    [1994, 11.7],
                    [1995, 10.6],
                    [1996, 12.8],
                    [1997, 10.8],
                    [1998, 10.3],
                    [1999, 9.4],
                    [2000, 8.7],
                    [2001, 9.0],
                    [2002, 8.9],
                    [2003, 10.1],
                    [2004, 9.80]
                ]
            }, {
                label: "Sweden",
                data: [
                    [1990, 5.8],
                    [1991, 6.0],
                    [1992, 5.9],
                    [1993, 5.5],
                    [1994, 5.7],
                    [1995, 5.3],
                    [1996, 6.1],
                    [1997, 5.4],
                    [1998, 5.4],
                    [1999, 5.1],
                    [2000, 5.2],
                    [2001, 5.4],
                    [2002, 6.2],
                    [2003, 5.9],
                    [2004, 5.89]
                ]
            }, {
                label: "Norway",
                data: [
                    [1990, 8.3],
                    [1991, 8.3],
                    [1992, 7.8],
                    [1993, 8.3],
                    [1994, 8.4],
                    [1995, 5.9],
                    [1996, 6.4],
                    [1997, 6.7],
                    [1998, 6.9],
                    [1999, 7.6],
                    [2000, 7.4],
                    [2001, 8.1],
                    [2002, 12.5],
                    [2003, 9.9],
                    [2004, 19.0]
                ]
            }];

            $('#placeholder').bind("plotselected", function(event, ranges) {

                var zoom = $("#zoom").prop("checked");

                if (zoom) {
                    $.each(plot.getXAxes(), function(_, axis) {
                        var opts = axis.options;
                        opts.min = ranges.xaxis.from;
                        opts.max = ranges.xaxis.to;
                    });
                    plot.setupGrid();
                    plot.draw();
                    plot.clearSelection();
                }
            });
        });
